//
//  functions.swift
//  SeaFramework
//
//  Created by Андрей Зорькин on 10/11/2019.
//  Copyright © 2019 Андрей Зорькин. All rights reserved.
//

import Foundation

public protocol SeaProtocol {
    var name: String { get }
    var description: String { get }
}

public struct SeaFramework {
    
    public struct Sea: SeaProtocol {
        public let name: String
        public let description: String
    }
    
    public static let blackSea = Sea(name: "Чёрное море", description: "Чёрное мо́ре — внутреннее море бассейна Атлантического океана. Проливом Босфор соединяется с Мраморным морем, далее, через пролив Дарданеллы (эти проливы зачастую называют Черноморскими проливами) — с Эгейским и Средиземным морями. Керченским проливом соединяется с Азовским морем. С севера в море глубоко врезается Крымский полуостров. По поверхности Чёрного моря проходит водная граница между Европой и Азией.")
    public static let mediterraneanSea = Sea(name: "Средиземное море", description: "Средизе́мное мо́ре — межматериковое море, по происхождению представляющее собой глубоководную псевдоабиссальную внутришельфовую депрессию, связанную на западе с Атлантическим океаном Гибралтарским проливом.")
    public static let caribbeanSea = Sea(name: "Карибское море", description: "Кари́бское мо́ре — окраинное полузамкнутое море бассейна Атлантического океана, с запада и юга ограничено Центральной и Южной Америкой, с севера и востока — Большими и Малыми Антильскими островами. На северо-западе через Юкатанский пролив соединено с Мексиканским заливом, на юго-западе — с Тихим океаном через искусственный Панамский канал.")
    
}
